//
//  requestURL.h
//  WhereAreYou
//
//  Created by lingnet on 2017/7/5.
//  Copyright © 2017年 徐仁强. All rights reserved.
//

#ifndef requestURL_h
#define requestURL_h
#define HEADER1 @"http://118.178.128.69:8087/whxtapp/app/"
/***********************************************************************一、首页****************************************************************************/
/***********************************************************************1.1首页****************************************************************************/
/**
 1.1.1 首页---- 已加
 */
#define HOMEPAGE HEADER1"main!homepage.action"


/***********************************************************************1.2城市记忆****************************************************************************/

/**
 1.2.1 城市记忆---- 已加
 */
#define CITYMEMORY HEADER1"city/cityMemory"


/***********************************************************************1.3 非遗传承****************************************************************************/

/**
 1.3.1 非遗类型---- 已加
 */
#define FYLX HEADER1"fycc/fylxOrjb"

/**
 1.3.2 非遗级别---- 已加
 */
#define FYJB HEADER1"fycc/fyjb"

/**
 1.3.3 非遗传承列表---- 已加
 */
#define FYCHLIST HEADER1"fycc/fychList"

/**
 1.3.4 非遗详情
 */
#define FYDETAIL HEADER1"fycc/fyDetail"


/***********************************************************************1.4 书香四溢****************************************************************************/

/**
 1.4.1 书籍分类---- 已加
 */
#define BOOKCATEGORY HEADER1"sxsy/bookCategory"

/**
 1.4.2 书籍列表---- 已加
 */
#define BOOKLIST HEADER1"sxsy/bookList"

/**
 1.4.3 书籍详情
 */
#define BOOKDETAIL HEADER1"sxsy/bookDetail"


/***********************************************************************1.5 数字资源****************************************************************************/

/**
 1.5.1 数字资源---- 已加
 */
#define DIGITALRESOURCE HEADER1"szzy/digitalResource"


/***********************************************************************1.6 资讯动态****************************************************************************/

/**
 1.6.1 分类---- 已加
 */
#define NEWSCATEGORY HEADER1"zxdt/newsCategory"

/**
 1.6.2 资讯列表---- 已加
 */
#define NEWSLIST HEADER1"zxdt/newsList"


/***********************************************************************1.7 呼市风光****************************************************************************/

/**
 1.7.1 风光列表
 */
#define FENGGLIST HEADER1"hs/fenggList"

/**
 1.7.2 风光类型
 */
#define SCENMECATEGORY HEADER1"hs/scenmeCategory"

/**
 1.7.3 风光详情
 */
#define FGDETAIL HEADER1"hs/fgDetail"


/***********************************************************************二、文化活动****************************************************************************/
/***********************************************************************2.1文化活动****************************************************************************/

/**
 2.1.1 文化类型---- 已加
 */
#define CULTURETYPE HEADER1"whhd/cultureType"

/**
 2.1.2 文化阶段 == 没有该功能  ---- 已加
 */
#define CULTURESTAGE HEADER1"culture!cultureStage.action"

/**
 2.1.3 文化活动列表---- 已加
 */
#define CULTUREACTIVITYLIST HEADER1"whhd/cultureActivityList"

/***********************************************************************2.2 文化地图****************************************************************************/

/**
 2.2.1 场馆分类---- 已加
 */
#define WHVENUECATEGORY HEADER1"whdt/venueCategory"

/**
 2.2.2 场馆地图
 */
#define VENUEMAP HEADER1"whdt/venueMap"

/***********************************************************************2.3 文化活动****************************************************************************/

/**
 2.3.1 活动列表==数据库中没有状态字段
 */
#define ACTIVITYLIST HEADER1"culture!activityList.action"

/***********************************************************************2.4 文化饮食****************************************************************************/

/**
 2.4.1 文化饮食列表
 */
#define CULTUREFOODLIST HEADER1"whys/cultureFoodList"


/***********************************************************************三、智慧场馆****************************************************************************/
/***********************************************************************3.1 智慧场馆****************************************************************************/

/**
 3.1.1 场馆分类---- 已加
 */
#define ZHVENUECATEGORY HEADER1"zhcg/venueCategory"

/**
 3.1.2 智慧场馆列表---- 已加
 */
#define ZHVENUELIST HEADER1"zhcg/venueList"

/***********************************************************************3.2 数字博物馆****************************************************************************/

/**
 3.2.1 数字博物馆列表---- 已加
 */
#define SZMUSEUM HEADER1"venue!museum.action"

/**
 3.2.2 博物馆详情
 */
#define SZMUSEUMDETAIL HEADER1"venue!museumDetail.action"

/**
 3.2.3 博物馆藏品
 */
#define SZCOLLECTIONLIST HEADER1"venue!collectionList.action"

/**
 3.2.4 藏品分类
 */
#define SZCOLLECTIONCATEGORY HEADER1"venue!collectionCategory.action"

/***********************************************************************四、个人中心****************************************************************************/
/***********************************************************************4.1 我的课程****************************************************************************/

/**
 4.1.1 我的课程---- 已加
 */
#define MYCLASSLIST HEADER1"user!myClassList.action"

/***********************************************************************4.2 我的收藏****************************************************************************/

/**
 4.2.1 我的收藏---- 已加
 */
#define MYFAVOURLIST HEADER1"user!myFavourList.action"

/***********************************************************************4.3 我的书架****************************************************************************/

/**
 4.3.1 我的书架---- 已加
 */
#define MYBOOKLIST HEADER1"user!myBooklist"

/***********************************************************************4.4 密码修改****************************************************************************/

/**
 4.4.1 密码修改---- 已加
 */
#define PASSWORDMODIFY HEADER1"user!passwordModify.action"

/**
 4.4.2 短信验证码==没有短信接口 ---- 已加
 */
#define GETVCODE HEADER1"user!getVcode.action"

/***********************************************************************4.5 登录****************************************************************************/

/**
 4.5.1 登录---- 已加
 */
#define LOGIN HEADER1"app_login/login"

/***********************************************************************4.6 我的借阅****************************************************************************/

/**
 4.6.1 我的借阅---- 已加
 */
#define MYBORROWLIST HEADER1"user!myBorrowList.action"

/***********************************************************************4.7 消息通知****************************************************************************/

/**
 4.7.1 消息列表
 */
#define MESSAGELIST HEADER1"user!messageList.action"









#endif /* requestURL_h */
